app/Controllers/Jalur.php

SELECT *
FROM `jalur`
---
    public function index()
    {
        $data['title']='Jalur';
        $data['menu']='master';
        $data['submenu']='jalur';
        $jalur = new JalurModel();
        $data['data']=$jalur->findAll();

UPDATE `jalur` SET `nama` = 'Nama', `nama_singkat` = 'Nama Singkat'
WHERE `id` = '3'
---
    public function simpan()
    {
        $data = $this->request->getPost();
        $model = new JalurModel();
        if($data['id']==""){
            $model->save($data);
        }else{
            $model->where('id',$data['id'])->set($data)->update();

DELETE FROM `jalur`
WHERE `id` = ''
---
    public function hapus()
    {
        $id=$this->request->getPost();
        $model=new JalurModel();
        $model->where('id',$id)->delete();